#ifndef BAZ_HEADER
#define BAZ_HEADER

#define unused __attribute__((unused))
#define private unused static

#define likely(x) __builtin_expect(!!(x), 1)
#define unlikely(x) __builtin_expect(!!(x), 0)

#define panic(msg)                                                             \
  do {                                                                         \
    print_msg_with_loc(__FILE__, __LINE__, msg, strlen(msg));                  \
    sys_exit(1);                                                               \
    __builtin_unreachable();                                                   \
  } while (0)

#define assert(cond)                                                           \
  do {                                                                         \
    if (unlikely(!(cond))) {                                                   \
      const char *msg = "Assertion failed";                                    \
      print_msg_with_loc(__FILE__, __LINE__, msg, strlen(msg));                \
      sys_exit(1);                                                             \
    }                                                                          \
  } while (0)

#define assert_msg(cond, msg)                                                  \
  do {                                                                         \
    if (unlikely(!(cond))) {                                                   \
      print_msg_with_loc(__FILE__, __LINE__, msg, strlen(msg));                \
      sys_exit(1);                                                             \
    }                                                                          \
  } while (0)

#define Span_debug(span)                                                       \
  print_msg_with_loc(__FILE__, __LINE__, (const char *)span.dat, span.len)

///////////////////////////////////////////////////////////////////////////////
// Types

#define NULL 0

// C++ already has bool defined (C++ not supported, but this keeps clangd happy)
#ifndef __cplusplus
typedef _Bool bool;
#define true 1
#define false 0
#endif

typedef unsigned char u8;
_Static_assert(sizeof(u8) == 1, "u8 should be 1 byte");
typedef unsigned short u16;
_Static_assert(sizeof(u16) == 2, "u16 should be 2 byte");
typedef unsigned int u32;
_Static_assert(sizeof(u32) == 4, "u32 should be 4 byte");
typedef unsigned long u64;
_Static_assert(sizeof(u64) == 8, "u64 should be 8 byte");

typedef char i8;
_Static_assert(sizeof(i8) == 1, "i8 should be 1 byte");
typedef short i16;
_Static_assert(sizeof(i16) == 2, "i16 should be 2 byte");
typedef int i32;
_Static_assert(sizeof(i32) == 4, "i32 should be 4 byte");
typedef long i64;
_Static_assert(sizeof(i64) == 8, "i64 should be 8 byte");

typedef i64 isize;
typedef u64 usize;

#define UINT8_MAX 255
#define UINT16_MAX 65535
#define UINT32_MAX 4294967295
#define UINT64_MAX 18446744073709551615L

///////////////////////////////////////////////////////////////////////////////
// Syscalls

// From glibc
#define STDOUT 1
#define STDERR 2
#define O_RDONLY 0
#define SEEK_END 2
#define PROT_READ 0x1
#define PROT_WRITE 0x2
#define MAP_PRIVATE 0x02
#define MAP_ANONYMOUS 0x20

isize sys_write(i32 fd, const void *buf, usize size) {
  register i64 rax __asm__("rax") = 1;
  register i32 rdi __asm__("rdi") = fd;
  register const void *rsi __asm__("rsi") = buf;
  register usize rdx __asm__("rdx") = size;
  __asm__ __volatile__("syscall"
                       : "+r"(rax)
                       : "r"(rdi), "r"(rsi), "r"(rdx)
                       : "rcx", "r11", "memory");
  return rax;
}

isize sys_lseek(i32 fd, isize offset, usize origin) {
  register i64 rax __asm__("rax") = 8;
